### Pandas - DataFrame and Series
Pandas is a powerful  data manipulation library in Python, widely used for data analysis and data cleaning. it provides two primary data structure; Series and DataFrame. A Series is a one-dimensionl array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

### Series
Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table

In [3]:
import pandas as pd
import numpy as np

In [4]:
data = [1,2,3,4,5]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# Dictionary
data1 = {
    'a':1,
    'b':2,
    'c':3
}

series1 = pd.Series(data1)
print(series1)

a    1
b    2
c    3
dtype: int64

In [6]:
data2 = [1,2,3,4,5,6,6]
index = [6,5,4,3,2,1,0]
series2 = pd.Series(data2, index=index)
print(series2)

6    1
5    2
4    3
3    4
2    5
1    6
0    6
dtype: int64

In [7]:
arr = np.array([1,2,3,4,5])
new_series  = pd.Series(arr)

In [8]:
print(new_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
## create dataframe form the dictionary
data = {
    'Name': ['Raimal', 'Raja', 'Professor'],
    'Age': [20,23,24],
    'City': ['Badin','hyderabad', 'Karachi']
}

df = pd.DataFrame(data)
print(df)

        Name  Age       City
0     Raimal   20      Badin
1       Raja   23  hyderabad
2  Professor   24    Karachi

In [10]:
## convert dataframe into a array
arr_df = np.array(df)
print(arr_df)

[['Raimal' 20 'Badin']
 ['Raja' 23 'hyderabad']
 ['Professor' 24 'Karachi']]

In [11]:
## create a  dataframe from a list of dictionaries
data = [
    {'Name':'Raimal',
     'Age':20,
     'city': 'Badin'
     },
    
    {'Name':'Professor',
     'Age':21, 
     'city': 'Hyderabad'
     },
    {'Name':'Raja',
     'Age':23, 
     'city': 'Karachi'
     },
]

df = pd.DataFrame(data)
print(df)
print(type(df))

        Name  Age       city
0     Raimal   20      Badin
1  Professor   21  Hyderabad
2       Raja   23    Karachi
<class 'pandas.core.frame.DataFrame'>

In [12]:
import pandas as pd
path = 'my.csv'
data_file = pd.read_csv(path)
data_file.head(5)
# print(df.head(5)) ## .head(5) for top 5 elements and .tail() for top bottom

,EAN,SKU,Sale price,Regular price,Categories,Brand
0,123123,IC70 WHITE,676,2456.36,Lifestyle Appliances > Speakers,BEC Akustik
1,12312312,IC70 BLACK,222,2456.36,Lifestyle Appliances > Speakers,BEC Akustik
2,3432543,IC70S Silver,454,4215.93,Lifestyle Appliances > Speakers,BEC Akustik
3,4654645,IC100 BLACK,121,2568.97,Lifestyle Appliances > Speakers,BEC Akustik
4,567657,IC100 WHITE,121,2568.97,Lifestyle Appliances > Speakers,BEC Akustik

In [13]:
type(df['Name'])

pandas.core.series.Series

In [14]:
df.loc[0] # row index

Name    Raimal
Age         20
city     Badin
Name: 0, dtype: object

In [15]:
df.iloc[0] ## index location

Name    Raimal
Age         20
city     Badin
Name: 0, dtype: object

In [16]:
df.loc[0][0]

C:\Users\Professor\AppData\Local\Temp\ipykernel_6288\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Raimal'

In [19]:
## accessing a specified element
df.at[2,'Age']

np.int64(23)

In [ ]:
df.at[2,'Name']

'Raja'

In [22]:
## Acceessing a specified element using .iat[]
df.iat[2,2]

'Karachi'

In [23]:
## Data manipulation with DataFrame
df

        Name  Age       city
0     Raimal   20      Badin
1  Professor   21  Hyderabad
2       Raja   23    Karachi

In [ ]:
## adding new column 
df['Salary']=[5000,4000,6000]

In [25]:
df

        Name  Age       city  Salary
0     Raimal   20      Badin    5000
1  Professor   21  Hyderabad    4000
2       Raja   23    Karachi    6000

In [27]:
## Remove a column
df.drop('Salary',axis=1)

        Name  Age       city
0     Raimal   20      Badin
1  Professor   21  Hyderabad
2       Raja   23    Karachi

In [ ]:
## drop it not perminanat for deleting 
df

        Name  Age       city  Salary
0     Raimal   20      Badin    5000
1  Professor   21  Hyderabad    4000
2       Raja   23    Karachi    6000

In [29]:
## for saving deletating add another parameter
df.drop('Salary', axis=1,inplace=True)

In [30]:
df

        Name  Age       city
0     Raimal   20      Badin
1  Professor   21  Hyderabad
2       Raja   23    Karachi

In [31]:
### increase age  to the column
df['Aged'] = df['Age']+1

In [32]:
df

        Name  Age       city  Aged
0     Raimal   20      Badin    21
1  Professor   21  Hyderabad    22
2       Raja   23    Karachi    24